# Parameter Type Id View Anchor Property

Source: https://www.revitapidocs.com/2026/db69591d-c05d-f841-58d5-fbc638512e66.htm

---

| Parameter Type Id View Anchor Property |
| --- |

"View Anchor"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId ViewAnchor { get; }
```

```
Public Shared ReadOnly Property ViewAnchor As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ ViewAnchor {
	ForgeTypeId^ get ();
}
```

```
static member ViewAnchor : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace